echostreams/nucemu/hw/usb/nuc970-usbd.h
    /*@}*/ /* end of group NUC970_USBD_EXPORTED_STRUCT */

    /// @cond HIDDEN_SYMBOLS
    extern uint32_t g_u32EpStallLock;
    extern uint8_t volatile g_usbd_Configured;
    extern uint8_t g_usbd_ShortPacket;
    extern uint8_t g_usbd_CtrlZero;
    extern uint8_t g_usbd_UsbAddr;
    extern uint8_t g_usbd_EpHalt[];
    extern uint32_t volatile g_usbd_DmaDone;
    extern uint32_t g_usbd_CtrlInSize;
    extern S_USBD_INFO_T gsInfo;
    extern S_USBD_CMD_T gUsbCmd;
    /// @endcond /* HIDDEN_SYMBOLS */
/*
    /// @cond HIDDEN_SYMBOLS
    typedef struct {

        union {
            volatile uint32_t EPDAT;
            volatile uint8_t  EPDAT_BYTE;

        } ep;
        volatile uint32_t EPINTSTS;
        volatile uint32_t EPINTEN;
        volatile const  uint32_t EPDATCNT;
        volatile uint32_t EPRSPCTL;
        volatile uint32_t EPMPS;
        volatile uint32_t EPTXCNT;
        volatile uint32_t EPCFG;
        volatile uint32_t EPBUFSTART;
        volatile uint32_t EPBUFEND;

    } USBD_EP_T;

    typedef struct {
        volatile const  uint32_t GINTSTS;
        uint32_t RESERVE0[1];
        volatile uint32_t GINTEN;
        uint32_t RESERVE1[1];
        volatile uint32_t BUSINTSTS;
        volatile uint32_t BUSINTEN;
        volatile uint32_t OPER;
        volatile const  uint32_t FRAMECNT;
        volatile uint32_t FADDR;
        volatile uint32_t TEST;
        union {
            volatile uint32_t CEPDAT;
            volatile uint8_t  CEPDAT_BYTE;
        } cep;
        volatile uint32_t CEPCTL;
        volatile uint32_t CEPINTEN;
        volatile uint32_t CEPINTSTS;
        volatile uint32_t CEPTXCNT;
        volatile const  uint32_t CEPRXCNT;
        volatile const  uint32_t CEPDATCNT;
        volatile const  uint32_t SETUP1_0;
        volatile const  uint32_t SETUP3_2;
        volatile const  uint32_t SETUP5_4;
        volatile const  uint32_t SETUP7_6;
        volatile uint32_t CEPBUFSTART;
        volatile uint32_t CEPBUFEND;
        volatile uint32_t DMACTL;
        volatile uint32_t DMACNT;
        USBD_EP_T EP[12];
        uint32_t RESERVE2[303];
        volatile uint32_t DMAADDR;
        volatile uint32_t PHYCTL;

    } USBD_T;

#define USBD   ((USBD_T *) USBD_BA)
*/
    /// @endcond


#define USBD_GINTSTS_USBIF_Pos           (0)                                               /*!< USBD GINTSTS: USBIF Position           */
#define USBD_GINTSTS_USBIF_Msk           (0x1ul << USBD_GINTSTS_USBIF_Pos)                 /*!< USBD GINTSTS: USBIF Mask               */

#define USBD_GINTSTS_CEPIF_Pos           (1)                                               /*!< USBD GINTSTS: CEPIF Position           */
#define USBD_GINTSTS_CEPIF_Msk           (0x1ul << USBD_GINTSTS_CEPIF_Pos)                 /*!< USBD GINTSTS: CEPIF Mask               */

#define USBD_GINTSTS_EPAIF_Pos           (2)                                               /*!< USBD GINTSTS: EPAIF Position           */
#define USBD_GINTSTS_EPAIF_Msk           (0x1ul << USBD_GINTSTS_EPAIF_Pos)                 /*!< USBD GINTSTS: EPAIF Mask               */

#define USBD_GINTSTS_EPBIF_Pos           (3)                                               /*!< USBD GINTSTS: EPBIF Position           */
#define USBD_GINTSTS_EPBIF_Msk           (0x1ul << USBD_GINTSTS_EPBIF_Pos)                 /*!< USBD GINTSTS: EPBIF Mask               */

#define USBD_GINTSTS_EPCIF_Pos           (4)                                               /*!< USBD GINTSTS: EPCIF Position           */
#define USBD_GINTSTS_EPCIF_Msk           (0x1ul << USBD_GINTSTS_EPCIF_Pos)                 /*!< USBD GINTSTS: EPCIF Mask               */

#define USBD_GINTSTS_EPDIF_Pos           (5)                                               /*!< USBD GINTSTS: EPDIF Position           */
#define USBD_GINTSTS_EPDIF_Msk           (0x1ul << USBD_GINTSTS_EPDIF_Pos)                 /*!< USBD GINTSTS: EPDIF Mask               */

#define USBD_GINTSTS_EPEIF_Pos           (6)                                               /*!< USBD GINTSTS: EPEIF Position           */
#define USBD_GINTSTS_EPEIF_Msk           (0x1ul << USBD_GINTSTS_EPEIF_Pos)                 /*!< USBD GINTSTS: EPEIF Mask               */

#define USBD_GINTSTS_EPFIF_Pos           (7)                                               /*!< USBD GINTSTS: EPFIF Position           */
#define USBD_GINTSTS_EPFIF_Msk           (0x1ul << USBD_GINTSTS_EPFIF_Pos)                 /*!< USBD GINTSTS: EPFIF Mask               */

#define USBD_GINTSTS_EPGIF_Pos           (8)                                               /*!< USBD GINTSTS: EPGIF Position           */
#define USBD_GINTSTS_EPGIF_Msk           (0x1ul << USBD_GINTSTS_EPGIF_Pos)                 /*!< USBD GINTSTS: EPGIF Mask               */

#define USBD_GINTSTS_EPHIF_Pos           (9)                                               /*!< USBD GINTSTS: EPHIF Position           */
#define USBD_GINTSTS_EPHIF_Msk           (0x1ul << USBD_GINTSTS_EPHIF_Pos)                 /*!< USBD GINTSTS: EPHIF Mask               */

#define USBD_GINTSTS_EPIIF_Pos           (10)                                              /*!< USBD GINTSTS: EPIIF Position           */
#define USBD_GINTSTS_EPIIF_Msk           (0x1ul << USBD_GINTSTS_EPIIF_Pos)                 /*!< USBD GINTSTS: EPIIF Mask               */

#define USBD_GINTSTS_EPJIF_Pos           (11)                                              /*!< USBD GINTSTS: EPJIF Position           */
#define USBD_GINTSTS_EPJIF_Msk           (0x1ul << USBD_GINTSTS_EPJIF_Pos)                 /*!< USBD GINTSTS: EPJIF Mask               */

#define USBD_GINTSTS_EPKIF_Pos           (12)                                              /*!< USBD GINTSTS: EPKIF Position           */
#define USBD_GINTSTS_EPKIF_Msk           (0x1ul << USBD_GINTSTS_EPKIF_Pos)                 /*!< USBD GINTSTS: EPKIF Mask               */

#define USBD_GINTSTS_EPLIF_Pos           (13)                                              /*!< USBD GINTSTS: EPLIF Position           */
#define USBD_GINTSTS_EPLIF_Msk           (0x1ul << USBD_GINTSTS_EPLIF_Pos)                 /*!< USBD GINTSTS: EPLIF Mask               */

#define USBD_GINTEN_USBIE_Pos            (0)                                               /*!< USBD GINTEN: USBIE Position            */
#define USBD_GINTEN_USBIE_Msk            (0x1ul << USBD_GINTEN_USBIE_Pos)                  /*!< USBD GINTEN: USBIE Mask                */

