echostreams/nucemu/hw/usb/nuc970-usbd.h
        //USBD->EP[u32Ep].EPCFG = (u32EpType | u32EpDir | USB_EP_CFG_VALID | (u32EpNum << 4));
    }

    /**
      * @brief       Set USB endpoint stall state
      * @param[in]   u32Ep  The USB endpoint ID.
      * @return      None
      * @details     Set USB endpoint stall state for the specified endpoint ID. Endpoint will respond STALL token automatically.
      */
    static __inline void USBD_SetEpStall(uint32_t u32Ep)
    {
        //if (u32Ep == CEP)
        //    USBD_SET_CEP_STATE(USB_CEPCTL_STALL);
        //else {
        //    USBD->EP[u32Ep].EPRSPCTL = USBD->EP[u32Ep].EPRSPCTL & 0xf7 | USB_EP_RSPCTL_HALT;
        //}
    }

    /**
     * @brief       Set USB endpoint stall state
     *
     * @param[in]   u32EpNum         USB endpoint
     * @return      None
     *
     * @details     Set USB endpoint stall state, endpoint will return STALL token.
     */
    static __inline void USBD_SetStall(uint32_t u32EpNum)
    {
        int i;

        //if (u32EpNum == 0)
        //    USBD_SET_CEP_STATE(USB_CEPCTL_STALL);
        //else {
        //    for (i = 0; i < USBD_MAX_EP; i++) {
        //        if (((USBD->EP[i].EPCFG & 0xf0) >> 4) == u32EpNum) {
        //            USBD->EP[i].EPRSPCTL = USBD->EP[i].EPRSPCTL & 0xf7 | USB_EP_RSPCTL_HALT;
        //        }
        //    }
        //}
    }

    /**
      * @brief       Clear USB endpoint stall state
      * @param[in]   u32Ep  The USB endpoint ID.
      * @return      None
      * @details     Clear USB endpoint stall state for the specified endpoint ID. Endpoint will respond ACK/NAK token.
      */
    static __inline void  USBD_ClearEpStall(uint32_t u32Ep)
    {
        //USBD->EP[u32Ep].EPRSPCTL = USB_EP_RSPCTL_TOGGLE;
    }

    /**
     * @brief       Clear USB endpoint stall state
     *
     * @param[in]   u32EpNum         USB endpoint
     * @return      None
     *
     * @details     Clear USB endpoint stall state, endpoint will return ACK/NAK token.
     */
    static __inline void USBD_ClearStall(uint32_t u32EpNum)
    {
        //int i;

        //for (i = 0; i < USBD_MAX_EP; i++) {
        //    if (((USBD->EP[i].EPCFG & 0xf0) >> 4) == u32EpNum) {
        //        USBD->EP[i].EPRSPCTL = USB_EP_RSPCTL_TOGGLE;
        //    }
        //}
    }

    /**
      * @brief       Get USB endpoint stall state
      * @param[in]   u32Ep  The USB endpoint ID.
      * @retval      0      USB endpoint is not stalled.
      * @retval      Others USB endpoint is stalled.
      * @details     Get USB endpoint stall state of the specified endpoint ID.
      */
    static __inline uint32_t USBD_GetEpStall(uint32_t u32Ep)
    {
        //return (USBD->EP[u32Ep].EPRSPCTL & USB_EP_RSPCTL_HALT);
        return 0;
    }

    /**
     * @brief       Get USB endpoint stall state
     *
     * @param[in]   u32EpNum         USB endpoint
     * @retval      0: USB endpoint is not stalled.
     * @retval      non-0: USB endpoint is stalled.
     *
     * @details     Get USB endpoint stall state.
     */
    static __inline uint32_t USBD_GetStall(uint32_t u32EpNum)
    {
        //int i;

        //for (i = 0; i < USBD_MAX_EP; i++) {
        //    if (((USBD->EP[i].EPCFG & 0xf0) >> 4) == u32EpNum) {
        //        return (USBD->EP[i].EPRSPCTL & USB_EP_RSPCTL_HALT);
        //    }
        //}
        return 0;
    }


    /*-------------------------------------------------------------------------------------------*/
    typedef void (*VENDOR_REQ)(void); /*!<USB Vendor request callback function */
    typedef void (*CLASS_REQ)(void); /*!<USB Class request callback function */
    typedef void (*SET_INTERFACE_REQ)(uint32_t u32AltInterface); /*!<USB Standard request "Set Interface" callback function */

    void USBD_Open(S_USBD_INFO_T* param, CLASS_REQ pfnClassReq, SET_INTERFACE_REQ pfnSetInterface);
    void USBD_Start(void);
    void USBD_ProcessSetupPacket(void);
    void USBD_StandardRequest(void);
    void USBD_UpdateDeviceState(void);
    void USBD_PrepareCtrlIn(uint8_t* pu8Buf, uint32_t u32Size);
    void USBD_CtrlIn(void);
    void USBD_CtrlOut(uint8_t* pu8Buf, uint32_t u32Size);
    void USBD_SwReset(void);
    void USBD_SetVendorRequest(VENDOR_REQ pfnVendorReq);



    /*@}*/ /* end of group NUC970_USBD_EXPORTED_FUNCTIONS */

    /*@}*/ /* end of group NUC970_USBD_Driver */

    /*@}*/ /* end of group NUC970_Device_Driver */

#ifdef __cplusplus
}
#endif

#endif //__USBD_H__

/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/
